**`teams/delius-core/oracle_db`** terragrunt plan on `pull_request` event [#75](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 3s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-core-ol-8-5-oracle-db-19c"
        name         = "delius_core_ol_8_5_oracle_db_19c"
      ~ tags         = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
            # (9 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "Delius Core Oracle Database Image"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-core-ol-8-5-oracle-db-19c"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "delius_core_ol_8_5_oracle_db_19c"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "application"                  = "DELIUS-CORE"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "delius_core_ol_8_5_oracle_db_19c"
          + "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.7"
          + "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.7"
          + "is-production"                = "true"
          + "os-version"                   = "oracle linux 8.5"
          + "owner"                        = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"             = "patch"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + tags_all                         = {
          + "application"                  = "DELIUS-CORE"
          + "branch"                       = "main"
          + "business-unit"                = "HMPPS"
          + "image-pipeline"               = "delius_core_ol_8_5_oracle_db_19c"
          + "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.7"
          + "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.7"
          + "is-production"                = "true"
          + "os-version"                   = "oracle linux 8.5"
          + "owner"                        = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"             = "patch"
          + "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }

      + image_scanning_configuration {
          + image_scanning_enabled = (known after apply)

          + ecr_configuration {
              + container_tags  = (known after apply)
              + repository_name = (known after apply)
            }
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 2 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-core-ol-8-5-oracle-db-19c/0.0.6" -> (known after apply)
      ~ date_created      = "2023-08-11T14:34:49.052Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-core-ol-8-5-oracle-db-19c/0.0.6" -> (known after apply)
        name              = "delius_core_ol_8_5_oracle_db_19c"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Linux" -> (known after apply)
      ~ tags              = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
            # (9 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
            # (9 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      ~ version           = "0.0.6" -> "0.0.7" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping { # forces replacement
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping { # forces replacement
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping { # forces replacement
          - device_name = "/dev/sdb" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 100 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping { # forces replacement
          - device_name = "/dev/sdc" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 100 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping { # forces replacement
          - device_name = "/dev/sde" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping { # forces replacement
          - device_name = "/dev/sdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping { # forces replacement
          - device_name = "/dev/sdg" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping { # forces replacement
          - device_name = "/dev/sdh" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping { # forces replacement
          - device_name = "/dev/sdi" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping { # forces replacement
          - device_name = "/dev/sdj" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping { # forces replacement
          - device_name = "/dev/sdk" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      - block_device_mapping { # forces replacement
          - device_name = "/dev/sds" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 4 -> null
              - volume_type           = "gp3" -> null
            }
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-core-ol-8-5-oracle-db-19c-0-0-6" -> (known after apply)
      ~ date_created                  = "2023-08-11T14:34:49.158Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-core-ol-8-5-oracle-db-19c-0-0-6" -> (known after apply)
      ~ name                          = "delius_core_ol_8_5_oracle_db_19c_0_0_6" -> "delius_core_ol_8_5_oracle_db_19c_0_0_7" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
            # (9 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
            # (9 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "image-recipe"                 = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
          ~ "infrastructure-configuration" = "delius_core_ol_8_5_oracle_db_19c/0.0.6" -> "delius_core_ol_8_5_oracle_db_19c/0.0.7"
            # (9 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

```
